Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Redis Reference Guide
ja_jp: Redisリファレンスガイド

source: Redis _strings_ can be used to store binary data, such as images. In this case, we will use `byte[]` as value type:
ja_jp: Redis の _文字列_ は、イメージのようなバイナリーデータを格納するために使用することができます。この場合、値のタイプとして `byte[]` を使用します。

source: Redis allows sending _messages_ to channels and listening for these messages. These features are available from the `pubsub` group.
ja_jp: Redisでは、チャンネルに _メッセージ_ を送信したり、そのメッセージをリッスンしたりすることができます。これらの機能は、 `pubsub` グループから利用できます。

source: Redis allows sending _messages_ to channels and listening for these messages. These features are available from the the `pubsub` group.
ja_jp: Redis では、_メッセージ_ をチャンネルに送信し、そのメッセージをリッスンすることができます。これらの機能は `pubsub` グループから利用できます。

source: Redis as cache backend
ja_jp: キャッシュバックエンドとしてのRedis

source: Redis backend for Cache extension
ja_jp: CacheエクステンションのためのRedisバックエンド

source: Redis client metrics
ja_jp: Redisクライアントメトリクス

source: Redis client metrics are automatically enabled when the application also uses the xref:telemetry-micrometer.adoc[`quarkus-micrometer`] extension. Micrometer collects the metrics of all the Redis clients implemented by the application.
ja_jp: Redisクライアント・メトリクスは、アプリケーションが xref:telemetry-micrometer.adoc[`quarkus-micrometer`] エクステンションを使用している場合は、自動的に有効になります。micrometerは、アプリケーションが実装するすべてのRedisクライアントのメトリクスを収集します。

source: Redis is an in-memory data store used as a database, cache, streaming engine, and message broker.
ja_jp: Redisは、データベース、キャッシュ、ストリーミングエンジン、メッセージブローカーとして使用されるインメモリデータストアです。

source: Redis is an in-memory data store used as a database, cache, streaming engine, and message broker. The Quarkus Redis extension allows integrating Quarkus applications with Redis.
ja_jp: Redis は、データベース、キャッシュ、ストリーミングエンジン、メッセージブローカーとして使用されるインメモリーデータストアです。Quarkus Redis エクステンションを使用すると、Quarkus アプリケーションと Redis を統合することができます。

source: Redis transactions
ja_jp: Redisトランザクション

source: Redis transactions are slightly different from relational database transactions. Redis transactions are a batch of commands executed altogether.
ja_jp: Redis トランザクションは、リレーショナルデータベースのトランザクションとは少し異なります。Redis トランザクションは、まとめて実行されるコマンドのバッチです。

source: Redpanda is a Kafka compatible event streaming platform. Because it provides a faster startup time dev services defaults to `vectorized/redpanda` images. You can select any version from https://hub.docker.com/r/vectorized/redpanda.
ja_jp: RedpandaはKafkaと互換性のあるイベントストリーミングプラットフォームです。 起動時間を高速にするため、Dev Services for Kafka はデフォルトで `vectorized/redpanda` イメージを使用します。 https://hub.docker.com/r/vectorized/redpanda から任意のバージョンを選択することができます。

source: Redpanda transactions does not support exactly-once processing.
ja_jp: Redpandaのトランザクションは正確に一回(exactly once)の処理をサポートしません。

source: Reduce redeployment needs as security requirements evolve.
ja_jp: セキュリティー要件が進化するにつれ、再デプロイの必要性を軽減できます。

source: Reduced Memory
ja_jp: メモリ使用量の削減

source: Reduced quarkus properties completion payload size.
ja_jp: クアルカスの特性を補完するペイロードサイズを縮小。

source: Reducing memory usage has not been a primary goal of Project Leyden so far, though this may evolve in the future.
ja_jp: メモリ使用量の削減は、今のところ Project Leyden の主要な目標ではありませんが、将来的に進化する可能性があります。

source: Reduction in Reflection Usage
ja_jp: リフレクション使用量の削減

source: Refer to the <<configuration-reference>> section for more details on the available properties.
ja_jp: 利用可能なプロパティーの詳細については、 <<configuration-reference>> セクションを参照してください。

source: Refer to the <<db-token-state-manager>> section of this guide for information on storing tokens in the database or other server-side storage solutions. This approach is suitable if you prefer and have compelling reasons to store the token state on the server.
ja_jp: データベースまたはその他のサーバー側ストレージソリューションにトークンを保存する方法は、このガイドの <<db-token-state-manager>> セクションを参照してください。この方法は、何らかの理由でトークンの状態をサーバー上に保存する必要がある場合に適しています。

source: Refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.0#jandex-upgrade[migration guide] for the details.
ja_jp: 詳細は link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.0#jandex-upgrade[移行ガイド]をご参照ください。

source: Refer to the xref:./management-interface-reference.adoc[management interface reference] for more information.
ja_jp: 詳しくは、 xref:./management-interface-reference.adoc[マネジメントインターフェイスのリファレンス] を参照してください。

source: Refer to the xref:all-config.adoc#quarkus-vertx-http_quarkus-http-non-application-root-path[Quarkus Vertx HTTP configuration reference] for details on how the non-application root path is configured.
ja_jp: アプリケーション以外のルートパスの設定方法について、詳しくは xref:all-config.adoc#quarkus-vertx-http_quarkus-http-non-application-root-path[Quarkus Vertx HTTP 設定リファレンス] を参照してください。

source: Refer to the xref:all-config.adoc#quarkus-vertx-http_quarkus.http.non-application-root-path[Quarkus Vertx HTTP configuration reference] for details on how the non-application root path is configured.
ja_jp: 非アプリケーションルートパスの設定方法について、詳しくは xref:all-config.adoc#quarkus-vertx-http_quarkus.http.non-application-root-path[Quarkus Vertx HTTP 設定リファレンス] を参照してください。

source: Refer to the xref:http-reference.adoc[HTTP guide] for more details.
ja_jp: 詳細は、xref:http-reference.adoc[HTTP ガイド] を参照してください。

source: Reference
ja_jp: 参考

source: Reference Guide
ja_jp: リファレンスガイド

source: Reference guide
ja_jp: リファレンスガイド

source: Reference guide for Configuring Hibernate Reactive API Configuration Properties
ja_jp: Hibernate Reactive API 設定プロパティーを設定するためのリファレンスガイド

source: Reference guide for OpenID Connect and OAuth2 Client and Filters.
ja_jp: OpenID Connect (OIDC) と OAuth2 のクライアント、フィルターのリファレンスガイド

source: Reference guide for SmallRye Reactive Messaging and AMQP.
ja_jp: SmallRye Reactive MessagingとAMQPのリファレンスガイド

source: Reference guide for SmallRye Reactive Messaging and RabbitMQ.
ja_jp: SmallRye Reactive MessagingとRabbitMQのリファレンスガイド

source: Reference guides
ja_jp: リファレンスガイド

source: Reference guides are _technical descriptions_ of the machinery and how to operate it. Reference material is _information-oriented_.
ja_jp: リファレンスガイドは、機械や操作方法などの _技術的な説明_ です。参考資料は、 _情報を重視_ しています。

source: Reference source code
ja_jp: リファレンスソースコード

source: Referenced in the templates via the message bundle namespace:
ja_jp: メッセージ・バンドル名前空間を介してテンプレート内で参照。

source: References
ja_jp: リファレンス

source: References should end in `-reference.adoc`
ja_jp: リファレンスは `-reference.adoc` で終わる必要があります。

source: Referencing a TLS configuration
ja_jp: TLS 設定の参照

source: Referencing the default truststore of SunJSSE
ja_jp: SunJSSE のデフォルトのトラストストアを参照する

source: Reflection Service
ja_jp: リフレクションサービス

source: Reflection-free Jackson serialization
ja_jp: リフレクションなしの Jackson シリアル化

source: Reflection-free Jackson serialization and deserialization
ja_jp: リフレクションのないJacksonのシリアライズとデシリアライズ

source: Refresh a couple more times. Unless you waited too long, you should again see exception, but this time it's "CircuitBreakerOpenException: getAvailability". This exception indicates that the circuit breaker opened and the `CoffeeRepositoryService#getAvailability()` method is not being called anymore.
ja_jp: さらに数回更新します。長く待ちすぎていなければ、再び例外が表示されるはずですが、今回は "CircuitBreakerOpenException: getAvailability" となっています。この例外は、サーキットブレーカーが開き、 `CoffeeRepositoryService#getAvailability()` メソッドが呼び出されなくなったことを示しています。

source: Refresh token time skew
ja_jp: リフレッシュトークンのタイムスキュー

source: Refresh token: (Optional) If the ID and access tokens expire, the Quarkus web-app can use the refresh token to get new ID and access tokens.
ja_jp: リフレッシュトークン: (オプション) ID およびアクセストークンの有効期限が切れた場合、Quarkus web-app はリフレッシュトークンを使用して新しい ID およびアクセストークンを取得できます。

source: Refresh two more times. Both times you should see text "RuntimeException: Service failed.", which is the exception thrown by `CoffeeRepositoryService#getAvailability()`.
ja_jp: さらに2回リフレッシュします。2回とも、"RuntimeException:Service failed." というテキストが表示されます。これは、 `CoffeeRepositoryService#getAvailability()` によってスローされる例外です。

source: RefreshToken is only used to refresh the current ID and access tokens as part of its <<session-management,session management>> process.
ja_jp: RefreshTokenは、その <<session-management,セッション管理>> プロセスの一部として、現在のIDとアクセストークンをリフレッシュするためにのみ使用されます。

source: Refreshing Access Tokens
ja_jp: アクセストークンの更新

source: Refreshing JsonWebKey set for verifying JWT tokens
ja_jp: JWTトークンを検証するためのJsonWebKeyセットの更新

source: Refreshing `JsonWebKey` set for verifying JWT tokens
ja_jp: JWTトークンを検証するための `JsonWebKey` セットのリフレッシュ

source: Refreshing `JsonWebKey` set to verify JWT tokens
ja_jp: JWT トークン検証用の `JsonWebKey` セットの更新

source: Refreshing access tokens
ja_jp: アクセストークンを更新する

source: Regardless of content type, ensure that the main title and any headings in your document are:
ja_jp: コンテンツの種類に関わらず、メインタイトルや文書の見出しは必ず付けてください。

source: Regardless of how the services were started, Compose Dev Services will configure dev services and injected configuration properties, but won't stop the services when the application is stopped.
ja_jp: サービスがどのように起動されたかに関わらず、Compose Dev Services は dev services と挿入された設定プロパティーを設定しますが、アプリケーションが停止してもサービスは停止しません。

source: Regardless of their name, these properties still make sense for Hibernate Reactive.
ja_jp: それらの名前に関わらず、これらのプロパティーは Hibernate Reactive でも意味を持ちます。

source: Register Jose4j Validator to verify JWT tokens for all OIDC tenants.
ja_jp: すべての OIDC テナントの JWT トークンを検証するために、Jose4j Validator を登録します。

source: Register OAuth2 handler to secure the `http://localhost:8080/protected` endpoint. This handler uses the GitHub provider to authenticate users and requests a `user:email` scope when redirecting users to GitHub. The handler is set up with a callback route which uses a returned authorizaion code and the provided `http://localhost:8080/login` redirect URL to complete the authorization code flow and acquire a GitHub access token.
ja_jp: `http://localhost:8080/protected` エンドポイントを保護するために OAuth2 ハンドラーを登録します。このハンドラーは GitHub プロバイダーを使用してユーザーを認証し、ユーザーを GitHub にリダイレクトする際に `user:email` スコープを要求します。ハンドラーにはコールバックルートが設定されており、返された認可コードと指定された `http://localhost:8080/login` リダイレクト URL を使用して認可コードフローを完了し、GitHub アクセストークンを取得します。

source: Register Resources for Use in Native Image
ja_jp: ネイティブイメージで使用するリソースの登録

source: Register Vert.x OIDC session handler which keeps the session details in memory.
ja_jp: セッション詳細をメモリーに保持する Vert.x OIDC セッションハンドラーを登録します。

source: Register a Bean Defining Annotation
ja_jp: アノテーションを定義する Bean の登録

source: Register a REST client, use the `github-api-client` configuration key
ja_jp: REST クライアントを登録し、 `github-api-client` 設定キーを使用します。

source: Register a callback that is executed once the rendering is finished.
ja_jp: レンダリング終了後に実行されるコールバックを登録します。

source: Register a custom `ClientRequestFiler` as explained in the <<customize-rest-client-request>> section if you prefer to set a different `Content-Type` such as `application/yaml` which is also supported according to the `OrderService` interface definition:
ja_jp: `OrderService` インターフェイスの定義に従って、`application/yaml` など別の `Content-Type` を設定したい場合は、<<customize-rest-client-request>> セクションで説明されているようにカスタム `ClientRequestFiler` を登録してください。

source: Register a gauge that will track the size of the list.
ja_jp: リストのサイズを追跡するゲージを登録します。

source: Register an OIDC client filter with the REST client to get and propagate the tokens.
ja_jp: REST クライアントに OIDC クライアントフィルターを登録して、トークンを取得および伝播します。

source: Register an OIDC token propagation filter with the REST client to propagate the incoming already-existing tokens.
ja_jp: REST クライアントに OIDC トークン伝播フィルターを登録して、既存の受信トークンを伝播します。

source: Register clients on demand
ja_jp: 必要に応じたクライアント登録

source: Register clients on start-up
ja_jp: 起動時のクライアント登録

source: Register for locale changes
ja_jp: ロケールの変更を登録

source: Register reflection
ja_jp: リフレクションの登録

source: Register the Gauge with the MeterRegistry
ja_jp: MeterRegistry にゲージを登録する

source: Register the GitHub application as described in the https://how-to.vertx.io/web-and-oauth2-oidc/[Securing a Web Application with OAuth2/OpenID Connect] tutorial, the only difference is that you should register a `http://localhost:8080/login` callback url, instead of `http://localhost:8080/callback`.
ja_jp: https://how-to.vertx.io/web-and-oauth2-oidc/[Securing a Web Application with OAuth2/OpenID Connect] チュートリアルの説明に従って GitHub アプリケーションを登録します。唯一の違いは、コールバック URL として `http://localhost:8080/callback` の代わりに `http://localhost:8080/login` を登録する必要があることです。

source: Register the annotation class and CDI default scope using the Jandex `DotName` class.
ja_jp: Jandex `DotName` クラスを使用して、アノテーションクラスと CDI デフォルトスコープを登録します。

source: Register the function to call to get the value of the gauge.
ja_jp: ゲージの値を取得するために呼び出す関数を登録します。

source: Register the output of the step executing `./mvnw ...` command (i.e. directory `target/native-image`) as a build artifact,
ja_jp: `./mvnw ...` コマンドを実行するステップの出力 (つまり、ディレクトリ `target/native-image`) をビルドアーティファクトとして登録します。

source: Register the output of the step executing the `native-image ...` command (i.e. files matching `target/*runner`) as build artifact.
ja_jp: `native-image ...` コマンドを実行するステップの出力 (つまり、 `target/*runner` に一致するファイル) をビルドアーティファクトとして登録します。

source: Register your own `io.quarkus.oidc.TokenStateManager' implementation as an `@ApplicationScoped` CDI bean if you need to customize the way the tokens are associated with the session cookie. For example, you may want to keep the tokens in a database and have only a database pointer stored in a session cookie. Note though that it may present some challenges in making the tokens available across multiple microservices nodes.
ja_jp: トークンがセッションクッキーと関連付けられる方法をカスタマイズする必要がある場合は、独自の `io.quarkus.oidc.TokenStateManager` 実装を `@ApplicationScoped` CDI Bean として登録します。例えば、トークンをデータベースに保存し、セッションクッキーにはデータベースポインターだけを保存させたいと思うかもしれません。しかし、複数のマイクロサービスノードでトークンを利用できるようにするには、いくつかの課題が生じる可能性があることに注意してください。

source: Registered OIDC client has a client id and usually, a client secret.
ja_jp: 登録された OIDC クライアントにはクライアント ID があり、通常はクライアントシークレットもあります。

source: Registered instances of `SecurityIdentityAugmentor` are invoked during the final stage of the security authentication process. For more information, see the xref:security-customization.adoc#security-identity-customization[Security Identity Customization] section of the "Security Tips and Tricks" guide.
ja_jp: 登録された `SecurityIdentityAugmentor` のインスタンスは、セキュリティ認証プロセスの最終段階で呼び出されます。詳細については、「セキュリティのヒントとコツ」ガイドの xref:security-customization.adoc#security-identity-customization[Security Identityのカスタマイズ] セクションを参照してください。

source: Registering Plugin and Listeners
ja_jp: プラグインとリスナーの登録

source: Registering Protobuf Schemas with Infinispan Server
ja_jp: InfinispanサーバーへのProtobufスキーマの登録

source: Registering Resources and ResourceBundles
ja_jp: リソースと ResourceBundle の登録

source: Registering Security Providers
ja_jp: セキュリティー プロバイダの登録

source: Registering a certificate from an extension
ja_jp: エクステンションからの証明書の登録

source: Registering an Object Substitution
ja_jp: オブジェクト置換の登録

source: Registering an extension in the catalog is independent from where the source code is. The link:https://hub.quarkiverse.io[quarkiverse repository] has some shortcuts to make releasing and testing extensions easier, but any extension can link:https://hub.quarkiverse.io/checklistfornewprojects/#make-your-extension-available-in-the-tooling[register into the catalog].
ja_jp: カタログにエクステンションの登録と、ソースコードの場所とは無関係です。 link:https://hub.quarkiverse.io[quarkiverse リポジトリー] には、エクステンションのリリースとテストを容易にするためのショートカットがいくつかありますが、どのエクステンションでも link:https://hub.quarkiverse.io/checklistfornewprojects/#make-your-extension-available-in-the-tooling[カタログに登録] できます。

source: Registering for proxy
ja_jp: プロキシーの登録

source: Registering for reflection
ja_jp: リフレクションのための登録

source: Registering resource bundles and resource files
ja_jp: リソースバンドルとリソースファイルの登録

source: Registers a class for reflection in Substrate. Constructors are always registered, while methods and fields are optional.
ja_jp: Substrate でリフレクションのクラスを登録します。コンストラクターは常に登録されますが、メソッドとフィールドはオプションです。

source: Registers the `MySpecialInterceptor` for this particular client.
ja_jp: この特定のクライアントのために `MySpecialInterceptor` を登録します。

source: Registration
ja_jp: 登録

source: Registration of synthetic components
ja_jp: 合成コンポーネントの登録

source: Registries were moved to extensions.
ja_jp: レジストリーはエクステンションに移動しました。

source: Registry Client Support in the Maven and Gradle Plugins
ja_jp: MavenおよびGradleプラグインにおけるレジストリクライアントのサポート

source: Registry client configuration location
ja_jp: レジストリクライアント設定の場所

source: Reinstall XCode for good measure
ja_jp: 念のため Xcode を再インストールします。

source: Reject the HTTP upgrade. Initial HTTP handshake ends with the 400 Bad Request response status code.
ja_jp: HTTP アップグレードを拒否します。最初の HTTP ハンドシェイクは、400 Bad Request レスポンスステータスコードで終了します。

source: Related Links
ja_jp: 関連リンク

source: Related OpenTelemetry Semantic Convention (not applied)
ja_jp: 関連する OpenTelemetry セマンティック規約 (適用されません)

source: Related content
ja_jp: 関連コンテンツ

source: Related resources
ja_jp: 関連リソース

source: Relation to existing Dev Services
ja_jp: 既存の Dev Services との関係

source: Relative path to directory containing collected example source files
ja_jp: 収集されたサンプルソースファイルを含むディレクトリーへの相対パス

source: Relative path to directory containing images
ja_jp: イメージが格納されているディレクトリーへの相対パス

source: Relative path to directory containing partial/reusable content
ja_jp: 部分的な/再利用可能なコンテンツを含むディレクトリーへの相対パス

source: Relative path to directory containing partial/reusable content (`*.adoc` files)
ja_jp: 部分的/再利用可能なコンテンツ (`*.adoc` ファイル) を含むディレクトリーへの相対パス

source: Relative path to documentation adoc files
ja_jp: ドキュメントadocファイルへの相対パス

source: Relative path to documentation adoc files (e.g. doc-concepts.adoc)
ja_jp: ドキュメントの adoc ファイルへの相対パス (例:doc-concepts.adoc)

source: Relative path to generated configuration `*.adoc` files
ja_jp: 生成された設定ファイル `*.adoc` への相対パス。

source: Relative path to source examples for documentation guides
ja_jp: ドキュメントガイドのソース例への相対パス

source: Relative time
ja_jp: 相対時間

source: Relax the validation of the encryption keys.
ja_jp: 暗号化キーの検証を緩和します。

source: Relax the validation of the signing keys.
ja_jp: 署名キーの検証を緩和します。

source: Relax the validation of the verification keys, setting this property to `true` will allow public RSA keys with the length less than 2048 bit.
ja_jp: 検証鍵の検証を緩和します。このプロパティーを `true` に設定すると、2048 ビット未満の長さの公開 RSA 鍵が許可されます。

source: Relax the validation of the verification keys; setting this property to `true` allows public RSA keys with a length of less than 2048 bits.
ja_jp: 検証キーの検証を緩和します。このプロパティーを `true` に設定すると、長さが 2048 ビット未満である公開 RSA 鍵が許可されます。

source: Release Notes
ja_jp: リリースノート

source: Release cadence and Long Term Support
ja_jp: リリース・ケイデンスと長期サポート(LTS)

source: Release the connection if it is not used for more than [connectionMaxIdleSeconds] seconds. If [connectionMaxIdleSeconds] < 0, disabled the feature that auto release the idle connections
ja_jp: [connectionMaxIdleSeconds] 秒以上接続が使用されない場合、接続を解放します。[connectionMaxIdleSeconds] < 0 の場合、アイドル状態の接続を自動的に解放する機能を無効にします。

source: Releasing with high frequency.
ja_jp: 高い頻度でリリースすること。

source: Releasing your Quarkus applications with JReleaser
ja_jp: JReleaserを使用したQuarkusアプリケーションのリリース

source: Reloading certificates
ja_jp: 証明書の再読み込み

source: Reloading the certificates
ja_jp: 証明書の再読込

source: Relocate configuration properties
ja_jp: 設定プロパティーの移動

source: Relocations have been put in place to simplify migrations.
ja_jp: 移行を簡略化するために再配置を導入しました。

source: Relying on the GraalVM infrastructure means that you are responsible for keeping the configuration file up to date as new Mandrel and GraalVM versions are released.
ja_jp: GraalVMインフラストラクチャに依存するということは、新しいMandrelとGraalVMのバージョンがリリースされるたびに、設定ファイルを最新の状態に保つ責任があるということです。

source: Remember `package-info.java` files? Hibernate ORM, for instance, tries to load them to inspect package-level annotations. In a lot of cases, these files don't exist, and that's perfectly normal.
ja_jp: `package-info.java` ファイルを覚えていますか？たとえば Hibernate ORM は、パッケージレベルのアノテーションを検査するためにこれらをロードしようとします。多くの場合、これらのファイルは存在しませんが、それは完全に正常なことです。

source: Remember that Grafana is accessible in an ephemeral port, so you need to check the logs to see which port is being used. In this example, the grafana endpoint is `grafana.endpoint=http://localhost:42797`.
ja_jp: Grafana はエフェメラルポートでアクセス可能であるため、どのポートが使用されているかを確認するにはログを確認する必要があります。この例では、Grafana エンドポイントは `grafana.endpoint=http://localhost:42797` です。

source: Remember that RESTEasy Reactive is our default REST layer covering both reactive and blocking workloads.
ja_jp: RESTEasy Reactiveは、リアクティブとブロッキングの両方のワークロードをカバーするデフォルトのRESTレイヤーであることを忘れないでください。

source: Remember that if an argument for `-Dquarkus.native.additional-build-args` includes the `,` symbol, it needs to be escaped to be processed correcly, e.g. `\\,`.
ja_jp: `-Dquarkus.native.additional-build-args` の引数に `,` シンボルが含まれている場合、正しく処理するためには、 `\\,` のようにエスケープする必要があることを覚えておいてください。

source: Remember that if an argument for `-Dquarkus.native.additional-build-args` includes the `,` symbol, it needs to be escaped to be processed correctly, e.g. `\\,`.
ja_jp: `-Dquarkus.native.additional-build-args` の引数に `,` シンボルが含まれている場合、正しく処理するためには、 `\\,` のようにエスケープする必要があることを覚えておいてください。

source: Remember that metrics extensions are optional. Keep metrics-related initialization isolated from other setup for your extension, and structure your code to avoid eager imports of metrics APIs. Gathering metrics can also be expensive. Consider using additional extension-specific configuration to control behavior of metrics if the presence/absence of metrics support isn't sufficient.
ja_jp: メトリクスエクステンションはオプションです。メトリクス関連の初期化を他のエクステンション設定から分離し、メトリクス API の熱心なインポートを回避するようにコードを構造化します。メトリクスの収集もコストがかかる可能性があります。メトリクスのサポートの有無が十分でない場合は、追加のエクステンション固有の設定を使用してメトリクスの動作を制御することを検討してください。

source: Remember that setting fields on the schema will override what has been generated, you might want to get and add to (so modify). Also know that the generated values might be null, so you will have to check for that.
ja_jp: スキーマのフィールドを設定すると、生成された内容がオーバーライドされることに注意してください。場合によっては、この内容を取得して追加 (つまり変更) する必要があります。また、生成された値が null になる可能性があるため、その点を確認する必要があります。

source: Remember that support for metrics is optional. Extensions can use an `Optional<MetricsCapabilityBuildItem> metricsCapability` parameter in their build step to test for the presence of an enabled metrics extension. Consider using additional configuration to control behavior of metrics. Datasource metrics can be expensive, for example, so additional configuration flags are used enable metrics collection on individual datasources.
ja_jp: メトリクスのサポートはオプションです。エクステンションはビルドステップで `Optional<MetricsCapabilityBuildItem> metricsCapability` を使用して、有効化されたメトリクスエクステンションの存在をテストできます。追加の設定を使用して、メトリクスの動作を制御することを検討してください。たとえば、データソースメトリクスは高額になる可能性があるため、追加の設定フラグを使用して、個々のデータソースでメトリクス収集を有効にします。

source: Remember that the `@Logged` annotation is `@Inherited`. If there's a bean class that inherits from `MyService`, the `LoggingInterceptor` will also apply to it.
ja_jp: `@Logged` アノテーションは `@Inherited` であることを思い出してください。 MyService を継承する Bean クラスがあれば、LoggingInterceptor も適用されます。

source: Remember to add `IndexDependencyBuildItem` artifacts to your `@BuildStep`.
ja_jp: `@BuildStep` に `IndexDependencyBuildItem` アーティファクトを追加することを忘れないでください。

source: Remember to set up the Panache and PostgreSQL JDBC driver. For more information, see xref:hibernate-orm-panache.adoc#setting-up-and-configuring-hibernate-orm-with-panache[Setting up and configuring Hibernate ORM with Panache].
ja_jp: Panache と PostgreSQL JDBC ドライバーをセットアップしてください。詳細については、xref:hibernate-orm-panache.adoc#setting-up-and-configuring-hibernate-orm-with-panache[Panache を使用した Hibernate ORM のセットアップと設定] を参照してください。

source: Remember, at the beginning of the guide, we added the `smallrye-mutiny-vertx-web-client` dependency to our `pom.xml` file. It's now time to use it.
ja_jp: このガイドの冒頭で、 `pom.xml` ファイルに `smallrye-mutiny-vertx-web-client` の依存関係を追加したことを思い出してください。 今がそれを使う番です。
